online_shop/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sdg"], ["description", "43"], ["price", "555.0"], ["user_id", 1], ["created_at", "2015-08-04 14:49:45.565318"], ["updated_at", "2015-08-04 14:49:45.565318"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "products" SET "name" = $1, "description" = $2, "price" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["name", "colaasadsf"], ["description", "adasdwaw"], ["price", "7.0"], ["updated_at", "2015-07-24 10:14:02.562864"], ["id", 2]]
---
  def update
    @product = Product.find(params[:id])
    @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 4]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 4]]
---
  def destroy
    Product.find(params[:id]).destroy