online_shop/app/controllers/products_controller.rb

  def show
    @products = Product.all
---
SELECT "products".* FROM "products"